txr-academy/FlashPod/nrf52840code/main.c
    k_mutex_lock(&state_mutex, K_FOREVER);
    struct bt_conn *c = phone_conn;
    k_mutex_unlock(&state_mutex);

    if (!c) return;
    bt_nus_send(c, msg, strlen(msg));
}

/* ══════════════════════════════════════════════════════════
 * Write command to ESP32 pod RX characteristic
 * ══════════════════════════════════════════════════════════ */
static void write_to_pod(int pod_idx, const char *cmd)
{
    if (pod_idx < 0 || pod_idx >= NUM_ESP32_PODS) return;
    if (!pods[pod_idx].connected || !pods[pod_idx].handles_found) return;

    bt_gatt_write_without_response(
        pods[pod_idx].conn,
        pods[pod_idx].rx_handle,
        cmd, strlen(cmd), false
    );
}

/* ══════════════════════════════════════════════════════════
 * NUS callbacks — phone → nRF
 * ══════════════════════════════════════════════════════════ */
static void notif_enabled_cb(bool enabled, void *ctx)
{
    ARG_UNUSED(ctx);
    notif_enabled = enabled;
}

static void received_from_phone(struct bt_conn *conn, const void *data,
                                 uint16_t len, void *ctx)
{
    ARG_UNUSED(ctx);

    char msg[32] = {0};
    memcpy(msg, data, MIN(len, sizeof(msg) - 1));

    for (int i = 0; i < (int)sizeof(msg); i++) {
        if (msg[i] == '\r' || msg[i] == '\n') { msg[i] = '\0'; break; }
    }

    printk("Rx:[%s]\n", msg);

    if (strncmp(msg, "TIMEOUT:", 8) == 0) {
        int secs = atoi(msg + 8);
        if (secs >= 1 && secs <= 60) {
            timeout_ms = (uint32_t)(secs * 1000);
            char reply[20];
            snprintf(reply, sizeof(reply), "TO:%ds\n", secs);
            send_to_phone(reply);
        } else {
            send_to_phone("TO:ERR\n");
        }
        return;
    }

    if (strcmp(msg, "STOP") == 0) {
        k_mutex_lock(&state_mutex, K_FOREVER);
        game_running = false;
        led_active   = false;
        k_mutex_unlock(&state_mutex);
        turn_off_all_pods();
        send_to_phone("STOPPED\n");
        k_sem_give(&round_done_sem);
        return;
    }

    if (current_mode == GAME_MODE_1) {
        if      (strcmp(msg, "RED")    == 0) { game_r=0xFF; game_g=0x00; game_b=0x00; }
        else if (strcmp(msg, "GREEN")  == 0) { game_r=0x00; game_g=0xFF; game_b=0x00; }
        else if (strcmp(msg, "BLUE")   == 0) { game_r=0x00; game_g=0x00; game_b=0xFF; }
        else if (strcmp(msg, "YELLOW") == 0) { game_r=0xFF; game_g=0xFF; game_b=0x00; }
        else if (strcmp(msg, "PINK")   == 0) { game_r=0xFF; game_g=0x14; game_b=0x93; }
        else if (strcmp(msg, "VIOLET") == 0) { game_r=0x94; game_g=0x00; game_b=0xD3; }
        else if (strcmp(msg, "START")  == 0) { /* use current colour */ }
        else { send_to_phone("UNKNOWN\n"); return; }

        k_mutex_lock(&state_mutex, K_FOREVER);
        game_running = true;
        k_mutex_unlock(&state_mutex);
        k_sem_give(&game_start_sem);
        send_to_phone("M1:GO\n");
        return;
    }

    if (current_mode == GAME_MODE_2) {
        if (strcmp(msg, "START") == 0) {
            k_mutex_lock(&state_mutex, K_FOREVER);
            game_running = true;
            k_mutex_unlock(&state_mutex);
            k_sem_give(&game_start_sem);
            send_to_phone("M2:GO\n");
        } else {
            send_to_phone("UNKNOWN\n");
        }
        return;
    }
}

static struct bt_nus_cb nus_listener = {
    .notif_enabled = notif_enabled_cb,
    .received      = received_from_phone,
};

/* ══════════════════════════════════════════════════════════
 * Receive notification from ESP32 pod
 * ══════════════════════════════════════════════════════════ */
static uint8_t pod_notify_cb(struct bt_conn *conn,
                              struct bt_gatt_subscribe_params *params,
                              const void *data, uint16_t length)
{
    ARG_UNUSED(conn);
    ARG_UNUSED(params);

    if (!data || length == 0) return BT_GATT_ITER_CONTINUE;

    char msg[64] = {0};
    memcpy(msg, data, MIN(length, sizeof(msg) - 1));

    int mlen = strlen(msg);
    if (mlen > 0 && (msg[mlen-1] == '\n' || msg[mlen-1] == '\r')) {
        msg[mlen-1] = '\0';
    }

    printk("Pod notify:[%s]\n", msg);

    k_mutex_lock(&state_mutex, K_FOREVER);
    game_mode_t mode    = current_mode;
    bool        already = round_ended;
    int         odd_pod = odd_pod_index;
    k_mutex_unlock(&state_mutex);

    if (already) return BT_GATT_ITER_CONTINUE;

    if (mode == GAME_MODE_1) {
        bool m1_timeout = (strstr(msg, ":TIMEOUT") != NULL);

        char fwd[68];
        snprintf(fwd, sizeof(fwd), "%s\n", msg);
        send_to_phone(fwd);
        k_mutex_lock(&state_mutex, K_FOREVER);
        round_ended = true;
        k_mutex_unlock(&state_mutex);

        /* Tap on ESP32 pod → short beep. Pod timeout → long beep. */
        request_beep(m1_timeout ? BEEP_LONG : BEEP_SHORT);   /* ── NEW ── */

        k_sem_give(&round_done_sem);
        return BT_GATT_ITER_CONTINUE;
    }

    int tapped_avail_idx = -1;
    if      (strncmp(msg, "POD2:", 5) == 0) tapped_avail_idx = 1;
    else if (strncmp(msg, "POD3:", 5) == 0) tapped_avail_idx = 2;
    else if (strncmp(msg, "POD4:", 5) == 0) tapped_avail_idx = 3;

    if (tapped_avail_idx < 0) {
        send_to_phone(msg);
        return BT_GATT_ITER_CONTINUE;
    }

    bool is_timeout = (strstr(msg, ":TIMEOUT") != NULL);

    if (is_timeout) {
        char fwd[68];
        snprintf(fwd, sizeof(fwd), "%s\n", msg);
        send_to_phone(fwd);
        return BT_GATT_ITER_CONTINUE;
    }

    turn_off_all_pods();

    k_mutex_lock(&state_mutex, K_FOREVER);
    round_ended = true;
    led_active  = false;
    k_mutex_unlock(&state_mutex);

    printk("M2 judge: tapped=%d odd=%d\n", tapped_avail_idx, odd_pod);

    if (odd_pod < 0) {
        return BT_GATT_ITER_CONTINUE;
    }

    if (tapped_avail_idx == odd_pod) {
        char fwd[68];
        snprintf(fwd, sizeof(fwd), "%s\n", msg);
        send_to_phone(fwd);
        printk("CORRECT pod%d\n", tapped_avail_idx + 1);
        request_beep(BEEP_SHORT);
    } else {
        char wrong[32];
        snprintf(wrong, sizeof(wrong), "POD%d:WRONG\n", tapped_avail_idx + 1);
        send_to_phone(wrong);
        printk("WRONG pod%d tapped odd was pod%d\n",
               tapped_avail_idx + 1, odd_pod + 1);
        request_beep(BEEP_LONG);
    }

    k_sem_give(&round_done_sem);
    return BT_GATT_ITER_CONTINUE;
}

/* ══════════════════════════════════════════════════════════
 * GATT discovery
 * ══════════════════════════════════════════════════════════ */
static uint8_t discover_cb(struct bt_conn *conn,
                            const struct bt_gatt_attr *attr,
                            struct bt_gatt_discover_params *params)
{
    int pod_idx = -1;
    for (int i = 0; i < NUM_ESP32_PODS; i++) {
        if (params == &pods[i].disc_params) {
            pod_idx = i;
            break;
        }
    }
    if (pod_idx < 0) return BT_GATT_ITER_STOP;

    if (!attr) {
        printk("Discovery done Pod%d rx=%d ccc=%d found=%d\n",
               pod_idx + 2,
               pods[pod_idx].rx_handle,
               pods[pod_idx].tx_ccc_handle,
               pods[pod_idx].handles_found);

