txr-academy/FlashPod/nrf52840code/main.c
        if (pods[pod_idx].handles_found) {
            pods[pod_idx].sub_params.notify       = pod_notify_cb;
            pods[pod_idx].sub_params.value        = BT_GATT_CCC_NOTIFY;
            pods[pod_idx].sub_params.ccc_handle   =
                pods[pod_idx].tx_ccc_handle;
            pods[pod_idx].sub_params.value_handle =
                pods[pod_idx].tx_ccc_handle - 1;
            int err = bt_gatt_subscribe(conn,
                          &pods[pod_idx].sub_params);
            printk("Subscribe Pod%d err=%d\n", pod_idx + 2, err);
        }
        return BT_GATT_ITER_STOP;
    }

    if (!bt_uuid_cmp(((struct bt_gatt_chrc *)attr->user_data)->uuid,
                     &nus_rx_uuid.uuid)) {
        pods[pod_idx].rx_handle = bt_gatt_attr_value_handle(attr);
        printk("Pod%d RX=%d\n", pod_idx + 2, pods[pod_idx].rx_handle);
    }

    if (!bt_uuid_cmp(((struct bt_gatt_chrc *)attr->user_data)->uuid,
                     &nus_tx_uuid.uuid)) {
        pods[pod_idx].tx_ccc_handle = attr->handle + 2;
        pods[pod_idx].handles_found = true;
        printk("Pod%d TX decl=%d ccc=%d\n",
               pod_idx + 2, attr->handle,
               pods[pod_idx].tx_ccc_handle);
    }

    return BT_GATT_ITER_CONTINUE;
}

/* ══════════════════════════════════════════════════════════
 * BLE scan
 * ══════════════════════════════════════════════════════════ */
static bool parse_device_name(struct bt_data *data, void *user_data)
{
    char *dev_name = user_data;
    if (data->type == BT_DATA_NAME_COMPLETE ||
        data->type == BT_DATA_NAME_SHORTENED) {
        memcpy(dev_name, data->data, MIN(data->data_len, 31));
        dev_name[MIN(data->data_len, 31)] = '\0';
        return false;
    }
    return true;
}

static void scan_cb(const bt_addr_le_t *addr, int8_t rssi,
                    uint8_t type, struct net_buf_simple *ad_data)
{
    char dev_name[32] = {0};
    bt_data_parse(ad_data, parse_device_name, dev_name);

    for (int i = 0; i < NUM_ESP32_PODS; i++) {
        if (strcmp(dev_name, pod_names[i]) == 0 &&
            !pods[i].connected) {
            printk("Found %s slot=%d\n", dev_name, i);
            bt_le_scan_stop();
            last_connecting_pod = i;
            struct bt_conn *conn = NULL;
            bt_conn_le_create(addr, BT_CONN_LE_CREATE_CONN,
                              BT_LE_CONN_PARAM_DEFAULT, &conn);
            if (conn) bt_conn_unref(conn);
            return;
        }
    }
}

static void start_scan(void)
{
    bool need = false;
    for (int i = 0; i < NUM_ESP32_PODS; i++) {
        if (!pods[i].connected) { need = true; break; }
    }
    if (!need) return;

    struct bt_le_scan_param scan_param = {
        .type     = BT_LE_SCAN_TYPE_ACTIVE,
        .options  = BT_LE_SCAN_OPT_NONE,
        .interval = 0x0500,
        .window   = 0x0050,
    };
    bt_le_scan_start(&scan_param, scan_cb);
    printk("Scanning...\n");
}

/* ══════════════════════════════════════════════════════════
 * BLE connection callbacks
 * ══════════════════════════════════════════════════════════ */
static void on_connected(struct bt_conn *conn, uint8_t err)
{
    if (err) {
        printk("Conn failed err=%d\n", err);
        last_connecting_pod = -1;
        start_scan();
        return;
    }

    struct bt_conn_info info;
    bt_conn_get_info(conn, &info);

    if (info.role == BT_CONN_ROLE_CENTRAL) {
        int idx = last_connecting_pod;
        last_connecting_pod = -1;

        if (idx < 0 || idx >= NUM_ESP32_PODS) {
            printk("Invalid pod slot\n");
            start_scan();
            return;
        }

        pods[idx].conn      = bt_conn_ref(conn);
        pods[idx].connected = true;
        printk("Pod%d connected slot=%d\n", idx + 2, idx);

        pods[idx].disc_params.uuid         = NULL;
        pods[idx].disc_params.func         = discover_cb;
        pods[idx].disc_params.start_handle = BT_ATT_FIRST_ATTRIBUTE_HANDLE;
        pods[idx].disc_params.end_handle   = BT_ATT_LAST_ATTRIBUTE_HANDLE;
        pods[idx].disc_params.type         = BT_GATT_DISCOVER_CHARACTERISTIC;

        bt_gatt_discover(conn, &pods[idx].disc_params);
        start_scan();

    } else {
        printk("Phone connected\n");
        k_mutex_lock(&state_mutex, K_FOREVER);
        phone_conn = bt_conn_ref(conn);
        k_mutex_unlock(&state_mutex);
    }
}

static void on_disconnected(struct bt_conn *conn, uint8_t reason)
{
    struct bt_conn_info info;
    bt_conn_get_info(conn, &info);

    if (info.role == BT_CONN_ROLE_CENTRAL) {
        for (int i = 0; i < NUM_ESP32_PODS; i++) {
            if (pods[i].conn == conn) {
                printk("Pod%d disconnected\n", i + 2);
                bt_conn_unref(pods[i].conn);
                pods[i].conn          = NULL;
                pods[i].connected     = false;
                pods[i].handles_found = false;
                pods[i].rx_handle     = 0;
                pods[i].tx_ccc_handle = 0;
                start_scan();
                break;
            }
        }
    } else {
        printk("Phone disconnected\n");
        k_mutex_lock(&state_mutex, K_FOREVER);
        if (phone_conn) {
            bt_conn_unref(phone_conn);
            phone_conn    = NULL;
        }
        game_running  = false;
        led_active    = false;
        notif_enabled = false;
        k_mutex_unlock(&state_mutex);
        turn_off_all_pods();
        k_sem_give(&adv_sem);
    }
}

static struct bt_conn_cb conn_callbacks = {
    .connected    = on_connected,
    .disconnected = on_disconnected,
};

/* ══════════════════════════════════════════════════════════
 * Mode switch button callback
 * ══════════════════════════════════════════════════════════ */
static void button_pressed(const struct device *dev,
                            struct gpio_callback *cb,
                            uint32_t pins)
{
    ARG_UNUSED(dev);
    ARG_UNUSED(cb);
    ARG_UNUSED(pins);

    if (gpio_pin_get_dt(&mode_btn) != 1) {
        return;
    }

    if (current_mode == GAME_MODE_1) {
        current_mode = GAME_MODE_2;
        printk("MODE 2\n");
        send_to_phone("MODE:2\n");
    } else {
        current_mode = GAME_MODE_1;
        printk("MODE 1\n");
        send_to_phone("MODE:1\n");
    }

