txr-academy/FlashPod/nrf52840code/main.c
    k_mutex_lock(&state_mutex, K_FOREVER);
    bool running = game_running;
    k_mutex_unlock(&state_mutex);

    if (running) {
        turn_off_all_pods();
        k_mutex_lock(&state_mutex, K_FOREVER);
        led_active  = false;
        round_ended = true;
        k_mutex_unlock(&state_mutex);
        k_sem_give(&round_done_sem);
        k_sem_give(&game_start_sem);
    }
}

/* ══════════════════════════════════════════════════════════
 * IR thread  (interrupt-driven)
 *
 * The IR GPIO ISR gives ir_detect_sem on the active edge.
 * This thread waits either for that semaphore or for the
 * round timeout — whichever comes first.
 * ══════════════════════════════════════════════════════════ */
static void ir_thread_fn(void *p1, void *p2, void *p3)
{
    ARG_UNUSED(p1); ARG_UNUSED(p2); ARG_UNUSED(p3);

    while (true) {
        /* ── Wait until the local LED is actually on ────── */
        k_mutex_lock(&state_mutex, K_FOREVER);
        bool    is_active = led_active;
        int64_t start     = led_on_time_ms;
        k_mutex_unlock(&state_mutex);

        if (!is_active) {
            /* Nothing to watch — sleep briefly and re-check.
             * The interrupt is disabled while the LED is off. */
            k_sleep(K_MSEC(50));
            continue;
        }

        /* ── Compute how much time remains ─────────────── */
        int64_t elapsed   = k_uptime_get() - start;
        int64_t remaining = (int64_t)timeout_ms - elapsed;

        if (remaining <= 0) {
            /* Already timed out — handle it */
            k_mutex_lock(&state_mutex, K_FOREVER);
            bool        already = round_ended;
            game_mode_t mode    = current_mode;
            k_mutex_unlock(&state_mutex);

            if (!already) {
                ir_sensor_int_disable();
                rgb_led_off();
                k_mutex_lock(&state_mutex, K_FOREVER);
                led_active = false;
                if (mode == GAME_MODE_1) {
                    round_ended = true;
                }
                k_mutex_unlock(&state_mutex);

                send_to_phone("POD1:TO\n");
                request_beep(BEEP_LONG);

                if (mode == GAME_MODE_1) {
                    k_sem_give(&round_done_sem);
                }
            }
            continue;
        }

        /* ── Drain any stale gives, then enable the IRQ ── */
        while (k_sem_take(&ir_detect_sem, K_NO_WAIT) == 0) {
            /* discard */
        }
        ir_sensor_int_enable();

        /* ── Block until detection or timeout ─────────── */
        int ret = k_sem_take(&ir_detect_sem, K_MSEC(remaining));

        ir_sensor_int_disable();

        if (ret != 0) {
            /* Timeout — no detection within the window */
            k_mutex_lock(&state_mutex, K_FOREVER);
            bool        already = round_ended;
            game_mode_t mode    = current_mode;
            k_mutex_unlock(&state_mutex);

            if (!already) {
                rgb_led_off();
                k_mutex_lock(&state_mutex, K_FOREVER);
                led_active = false;
                if (mode == GAME_MODE_1) {
                    round_ended = true;
                }
                k_mutex_unlock(&state_mutex);

                send_to_phone("POD1:TO\n");
                request_beep(BEEP_LONG);

                if (mode == GAME_MODE_1) {
                    k_sem_give(&round_done_sem);
                }
            }
            continue;
        }

        /* ── IR detected! ─────────────────────────────── */
        elapsed = k_uptime_get() - start;

        k_mutex_lock(&state_mutex, K_FOREVER);
        bool        already = round_ended;
        game_mode_t mode    = current_mode;
        int         odd_pod = odd_pod_index;
        k_mutex_unlock(&state_mutex);

        if (already) continue;

        if (mode == GAME_MODE_1) {
            rgb_led_off();
            k_mutex_lock(&state_mutex, K_FOREVER);
            led_active  = false;
            round_ended = true;
            k_mutex_unlock(&state_mutex);

            char msg[24];
            snprintf(msg, sizeof(msg), "POD1:RT:%d\n", (int32_t)elapsed);
            send_to_phone(msg);
            printk("%s", msg);
            request_beep(BEEP_SHORT);
            k_sem_give(&round_done_sem);

        } else {
            turn_off_all_pods();
            k_mutex_lock(&state_mutex, K_FOREVER);
            led_active  = false;
            round_ended = true;
            k_mutex_unlock(&state_mutex);

            if (odd_pod == 0) {
                char msg[24];
                snprintf(msg, sizeof(msg),
                         "POD1:RT:%d\n", (int32_t)elapsed);
                send_to_phone(msg);
                printk("%s", msg);
                request_beep(BEEP_SHORT);
            } else {
                send_to_phone("POD1:WRONG\n");
                printk("POD1:WRONG\n");
                request_beep(BEEP_LONG);
            }
            k_sem_give(&round_done_sem);
        }
    }
}

/* ══════════════════════════════════════════════════════════
 * Game thread
 * ══════════════════════════════════════════════════════════ */
static void game_thread_fn(void *p1, void *p2, void *p3)
{
    ARG_UNUSED(p1); ARG_UNUSED(p2); ARG_UNUSED(p3);

    while (true) {
        k_sem_take(&game_start_sem, K_FOREVER);

        k_mutex_lock(&state_mutex, K_FOREVER);
        bool        running = game_running;
        game_mode_t mode    = current_mode;
        uint32_t    tmo     = timeout_ms;
        k_mutex_unlock(&state_mutex);

        if (!running) continue;

        int available[4];
        int count = build_available(available);

        printk("Mode%d %d pods\n", mode, count);

        if (mode == GAME_MODE_1) {
            k_mutex_lock(&state_mutex, K_FOREVER);
            uint8_t r = game_r, g = game_g, b = game_b;
            k_mutex_unlock(&state_mutex);

            k_mutex_lock(&state_mutex, K_FOREVER);
            round_ended = false;
            k_mutex_unlock(&state_mutex);

            int pod = available[sys_rand32_get() % count];
            printk("M1:pod=%d\n", pod + 1);

            if (pod == 0) {
                rgb_led_set_all(r, g, b, 0xFF);
                k_mutex_lock(&state_mutex, K_FOREVER);
                led_active     = true;
                led_on_time_ms = k_uptime_get();
                k_mutex_unlock(&state_mutex);
                send_to_phone("POD1:ON\n");
            } else {
                char cmd[16];
                snprintf(cmd, sizeof(cmd), "ON:%02X%02X%02X", r, g, b);
                write_to_pod(pod - 1, cmd);
                k_sleep(K_MSEC(20));
                char notify[20];
                snprintf(notify, sizeof(notify), "POD%d:ON\n", pod + 1);
                send_to_phone(notify);
            }

            int sem_ret = k_sem_take(&round_done_sem, K_MSEC(tmo + 500));

            turn_off_all_pods();
            k_mutex_lock(&state_mutex, K_FOREVER);
            led_active = false;
            round_ended = true;
            k_mutex_unlock(&state_mutex);

            /* If nobody tapped in time, fire the long beep ourselves —
             * don't rely solely on the ESP32 pod's own remote timeout
             * notification, since with short timeouts that message can
             * race the dongle's own deadline over the BLE link and
             * never arrive before we already turn the pod off. */
            if (sem_ret != 0) {
                request_beep(BEEP_LONG);   /* ── FIX: dongle-driven Mode 1 timeout beep ── */
            }

        } else {
            int same_idx = sys_rand32_get() % NUM_COLOURS_M2;
            int odd_idx  = random_m2_colour_excluding(same_idx);
            int odd_pod  = available[sys_rand32_get() % count];

            printk("M2:same=%s odd=%s odd_pod=%d\n",
                   colours_m2[same_idx].name,
                   colours_m2[odd_idx].name,
                   odd_pod + 1);

