txr-academy/FlashPod/nrf52840code/main.c
            k_mutex_lock(&state_mutex, K_FOREVER);
            odd_pod_index = odd_pod;
            round_ended   = false;
            k_mutex_unlock(&state_mutex);
            printk("M2 set: odd_pod=%d count=%d\n", odd_pod, count);

            int64_t round_start = k_uptime_get();

            for (int i = 0; i < count; i++) {
                int  p      = available[i];
                bool is_odd = (p == odd_pod);

                uint8_t r = is_odd ? colours_m2[odd_idx].r
                                   : colours_m2[same_idx].r;
                uint8_t g = is_odd ? colours_m2[odd_idx].g
                                   : colours_m2[same_idx].g;
                uint8_t b = is_odd ? colours_m2[odd_idx].b
                                   : colours_m2[same_idx].b;

                if (p == 0) {
                    rgb_led_set_all(r, g, b, 0xFF);
                    k_mutex_lock(&state_mutex, K_FOREVER);
                    led_active     = true;
                    led_on_time_ms = round_start;
                    k_mutex_unlock(&state_mutex);
                } else {
                    char cmd[16];
                    snprintf(cmd, sizeof(cmd),
                             "ON:%02X%02X%02X", r, g, b);
                    write_to_pod(p - 1, cmd);
                    k_sleep(K_MSEC(20));
                }
            }

            char notify[20];
            snprintf(notify, sizeof(notify),
                     "ODD:POD%d\n", odd_pod + 1);
            send_to_phone(notify);

            int sem_ret = k_sem_take(&round_done_sem, K_MSEC(tmo));

            turn_off_all_pods();
            k_mutex_lock(&state_mutex, K_FOREVER);
            led_active  = false;
            round_ended = true;
            k_mutex_unlock(&state_mutex);

            if (sem_ret != 0) {
                send_to_phone("ROUND:TO\n");
                request_beep(BEEP_LONG);
            }
        }

        k_sleep(K_SECONDS(1));

        k_mutex_lock(&state_mutex, K_FOREVER);
        bool still_running = game_running;
        k_mutex_unlock(&state_mutex);

        if (still_running) {
            k_sem_give(&game_start_sem);
        }
    }
}

/* ══════════════════════════════════════════════════════════
 * UART console thread
 * ══════════════════════════════════════════════════════════ */
static void uart_console_thread_fn(void *p1, void *p2, void *p3)
{
    ARG_UNUSED(p1); ARG_UNUSED(p2); ARG_UNUSED(p3);

    printk("UART console ready — type commands:\n");
    printk("  START, STOP, RED, GREEN, BLUE, YELLOW, PINK, VIOLET, TIMEOUT:N\n");

    while (true) {
        char *line = console_getline();
        if (!line) continue;

        char cmd[32] = {0};
        int j = 0;
        for (int i = 0; line[i] && j < (int)(sizeof(cmd) - 1); i++) {
            char c = line[i];
            if (c == '\r' || c == '\n') break;
            if (c >= 'a' && c <= 'z') c -= 32;
            cmd[j++] = c;
        }
        cmd[j] = '\0';

        if (cmd[0] == '\0') continue;

        printk("Console cmd:[%s]\n", cmd);

        if (strncmp(cmd, "TIMEOUT:", 8) == 0) {
            int secs = atoi(cmd + 8);
            if (secs >= 1 && secs <= 60) {
                timeout_ms = (uint32_t)(secs * 1000);
                printk("Timeout set to %ds\n", secs);
            } else {
                printk("TIMEOUT error (1-60)\n");
            }
            continue;
        }

        if (strcmp(cmd, "STOP") == 0) {
            k_mutex_lock(&state_mutex, K_FOREVER);
            game_running = false;
            led_active   = false;
            k_mutex_unlock(&state_mutex);
            turn_off_all_pods();
            printk("Game STOPPED\n");
            send_to_phone("STOPPED\n");
            k_sem_give(&round_done_sem);
            continue;
        }

        if (current_mode == GAME_MODE_1) {
            if      (strcmp(cmd, "RED")    == 0) { game_r=0xFF; game_g=0x00; game_b=0x00; }
            else if (strcmp(cmd, "GREEN")  == 0) { game_r=0x00; game_g=0xFF; game_b=0x00; }
            else if (strcmp(cmd, "BLUE")   == 0) { game_r=0x00; game_g=0x00; game_b=0xFF; }
            else if (strcmp(cmd, "YELLOW") == 0) { game_r=0xFF; game_g=0xFF; game_b=0x00; }
            else if (strcmp(cmd, "PINK")   == 0) { game_r=0xFF; game_g=0x14; game_b=0x93; }
            else if (strcmp(cmd, "VIOLET") == 0) { game_r=0x94; game_g=0x00; game_b=0xD3; }
            else if (strcmp(cmd, "START")  == 0) { /* use current colour */ }
            else { printk("Unknown command\n"); continue; }

            k_mutex_lock(&state_mutex, K_FOREVER);
            game_running = true;
            k_mutex_unlock(&state_mutex);
            k_sem_give(&game_start_sem);
            printk("Mode 1 GO (R=%02X G=%02X B=%02X)\n", game_r, game_g, game_b);
            send_to_phone("M1:GO\n");
            continue;
        }

        if (current_mode == GAME_MODE_2) {
            if (strcmp(cmd, "START") == 0) {
                k_mutex_lock(&state_mutex, K_FOREVER);
                game_running = true;
                k_mutex_unlock(&state_mutex);
                k_sem_give(&game_start_sem);
                printk("Mode 2 GO\n");
                send_to_phone("M2:GO\n");
            } else {
                printk("Unknown command\n");
            }
            continue;
        }
    }
}

/* ══════════════════════════════════════════════════════════
 * main()
 * ══════════════════════════════════════════════════════════ */
int main(void)
{
    int err;

    printk("Blazepod1 starting\n");

    if (!gpio_is_ready_dt(&mode_btn)) {
        printk("Mode btn not ready\n");
        return 0;
    }
    gpio_pin_configure_dt(&mode_btn, GPIO_INPUT);
    gpio_pin_interrupt_configure_dt(&mode_btn, GPIO_INT_EDGE_TO_ACTIVE);
    gpio_init_callback(&button_cb_data, button_pressed,
                       BIT(mode_btn.pin));
    gpio_add_callback(mode_btn.port, &button_cb_data);
    printk("Mode btn ready pin=%d\n", mode_btn.pin);

    if (rgb_led_init() != 0) { printk("LED failed\n"); return 0; }
    rgb_led_off();

